[
  {
    "title": "What is Machine Learning?",
    "content": "Machine Learning is teaching computers to learn from data, just like how you learn from experience!",
    "icon": "Brain"
  },
  {
    "title": "Your First ML Concept: Classification",
    "content": "Classification is like sorting your toys into different boxes based on their features.",
    "icon": "GitBranch"
  },
  {
    "title": "Fun with Numbers: Prediction",
    "content": "Prediction is guessing a number based on other numbers, like guessing how many candies are in a jar.",
    "icon": "TrendingUp"
  },
  {
    "title": "Exploring Data: Visualization",
    "content": "Data visualization is like drawing pictures to understand your data better. It helps us see patterns!",
    "icon": "BarChart"
  },
  {
    "title": "Learning from Mistakes: Model Evaluation",
    "content": "Evaluating your model is like checking your homework. It helps us know how well our machine is learning!",
    "icon": "CheckCircle"
  },
  {
    "title": "Making Decisions: Decision Trees",
    "content": "A decision tree is like a game of 20 questions, where each answer leads to a new question or a final decision.",
    "icon": "GitFork"
  },
  {
    "title": "Finding Patterns: Clustering",
    "content": "Clustering is grouping similar things together, like organizing your closet by types of clothes.",
    "icon": "Group"
  },
  {
    "title": "Learning from Experience: Reinforcement Learning",
    "content": "Reinforcement learning is like training a pet. The computer learns by getting rewards for good actions!",
    "icon": "Award"
  },
  {
    "title": "Thinking Like a Brain: Neural Networks",
    "content": "Neural networks are like a big team of helpers in your brain, working together to solve complex problems!",
    "icon": "Network"
  },
  {
    "title": "Words and Language: Natural Language Processing",
    "content": "Natural Language Processing helps computers understand and respond in human languages, like when you talk to a smart speaker!",
    "icon": "MessageSquare"
  },
  {
    "title": "Seeing the World: Computer Vision",
    "content": "Computer Vision teaches machines to 'see' and understand images, just like how you recognize objects and faces!",
    "icon": "Eye"
  },
  {
    "title": "Creativity and AI: Generative Models",
    "content": "Generative models are like having an AI artist that can create new images, music, or text based on what it has learned!",
    "icon": "Paintbrush"
  },
  {
    "title": "Ethical AI: Fairness and Bias",
    "content": "It's important to make sure AI treats everyone fairly and doesn't make unfair decisions based on things like gender or race.",
    "icon": "Shield"
  },
  {
    "title": "AI in the Real World: Applications",
    "content": "AI is used in many areas of our lives, from recommending movies to helping doctors diagnose diseases!",
    "icon": "Globe"
  },
  {
    "title": "The Future of AI: What's Next?",
    "content": "AI is always improving! We'll explore exciting new developments and imagine what AI might be able to do in the future.",
    "icon": "Rocket"
  }
]
